{
  "6":{
    "OwnerUserId":5.0,
    "CreationDate":"2010-07-19T19:14:44Z",
    "Score":272,
    "Title":"The Two Cultures: statistics vs. machine learning?",
    "Body":"<p>Last year, I read a blog post from <a href=\"http:\/\/anyall.org\/\">Brendan O'Connor<\/a> entitled <a href=\"http:\/\/anyall.org\/blog\/2008\/12\/statistics-vs-machine-learning-fight\/\">\"Statistics vs. Machine Learning, fight!\"<\/a> that discussed some of the differences between the two fields.  <a href=\"http:\/\/andrewgelman.com\/2008\/12\/machine_learnin\/\">Andrew Gelman responded favorably to this<\/a>:<\/p>\n\n<p>Simon Blomberg: <\/p>\n\n<blockquote>\n  <p>From R's fortunes\n  package: To paraphrase provocatively,\n  'machine learning is statistics minus\n  any checking of models and\n  assumptions'.\n  -- Brian D. Ripley (about the difference between machine learning\n  and statistics) useR! 2004, Vienna\n  (May 2004) :-) Season's Greetings!<\/p>\n<\/blockquote>\n\n<p>Andrew Gelman:<\/p>\n\n<blockquote>\n  <p>In that case, maybe we should get rid\n  of checking of models and assumptions\n  more often. Then maybe we'd be able to\n  solve some of the problems that the\n  machine learning people can solve but\n  we can't!<\/p>\n<\/blockquote>\n\n<p>There was also the <a href=\"http:\/\/projecteuclid.org\/euclid.ss\/1009213726\"><strong>\"Statistical Modeling: The Two Cultures\"<\/strong> paper<\/a> by Leo Breiman in 2001 which argued that statisticians rely too heavily on data modeling, and that machine learning techniques are making progress by instead relying on the <em>predictive accuracy<\/em> of models.<\/p>\n\n<p>Has the statistics field changed over the last decade in response to these critiques?  Do the <em>two cultures<\/em> still exist or has statistics grown to embrace machine learning techniques such as neural networks and support vector machines?<\/p>\n"
  },
  "21":{
    "OwnerUserId":59.0,
    "CreationDate":"2010-07-19T19:24:36Z",
    "Score":4,
    "Title":"Forecasting demographic census",
    "Body":"<p>What are some of the ways to forecast demographic census with some validation and calibration techniques?<\/p>\n\n<p>Some of the concerns:<\/p>\n\n<ul>\n<li>Census blocks vary in sizes as rural\nareas are a lot larger than condensed\nurban areas. Is there a need to account for the area size difference?<\/li>\n<li>if let's say I have census data\ndating back to 4 - 5 census periods,\nhow far can i forecast it into the\nfuture?<\/li>\n<li>if some of the census zone change\nlightly in boundaries, how can i\naccount for that change?<\/li>\n<li>What are the methods to validate\ncensus forecasts? for example, if i\nhave data for existing 5 census\nperiods, should I model the first 3\nand test it on the latter two? or is\nthere another way?<\/li>\n<li>what's the state of practice in\nforecasting census data, and what are\nsome of the state of the art methods?<\/li>\n<\/ul>\n"
  },
  "22":{
    "OwnerUserId":66.0,
    "CreationDate":"2010-07-19T19:25:39Z",
    "Score":208,
    "Title":"Bayesian and frequentist reasoning in plain English",
    "Body":"<p>How would you describe in plain English the characteristics that distinguish Bayesian from Frequentist reasoning?<\/p>\n"
  },
  "31":{
    "OwnerUserId":13.0,
    "CreationDate":"2010-07-19T19:28:44Z",
    "Score":138,
    "Title":"What is the meaning of p values and t values in statistical tests?",
    "Body":"<p>After taking a statistics course and then trying to help fellow students, I noticed one subject that inspires much head-desk banging is interpreting the results of statistical hypothesis tests.  It seems that students easily learn how to perform the calculations required by a given test but get hung up on interpreting the results.  Many computerized tools report test results in terms of \"p values\" or \"t values\".<\/p>\n\n<p>How would you explain the following points to college students taking their first course in statistics:<\/p>\n\n<ul>\n<li><p>What does a \"p-value\" mean in relation to the hypothesis being tested?  Are there cases when one should be looking for a high p-value or a low p-value?<\/p><\/li>\n<li><p>What is the relationship between a p-value and a t-value?<\/p><\/li>\n<\/ul>\n"
  },
  "36":{
    "OwnerUserId":8.0,
    "CreationDate":"2010-07-19T19:31:47Z",
    "Score":58,
    "Title":"Examples for teaching: Correlation does not mean causation",
    "Body":"<p>There is an old saying: \"Correlation does not mean causation\". When I teach, I tend to use the following standard examples to illustrate this point:<\/p>\n\n<ol>\n<li>number of storks and birth rate in Denmark;<\/li>\n<li>number of priests in America and alcoholism;<\/li>\n<li>in the start of the 20th century it was noted that there was a strong correlation between 'Number of radios' and 'Number of people in Insane Asylums'<\/li>\n<li>and my favorite: <a href=\"http:\/\/en.wikipedia.org\/wiki\/File%3aPiratesVsTemp%28en%29.svg\">pirates cause global warming<\/a>.<\/li>\n<\/ol>\n\n<p>However, I do not have any references for these examples and whilst amusing, they are obviously false.<\/p>\n\n<p>Does anyone have any other good examples?<\/p>\n"
  }
}